# เกมส์เป่ายิ้งฉุบ

player1 = int(input("ผู้เล่นคนที่ 1 , เลือก ค้อน = 3 , กรรไกร = 2 , กระดาษ = 1 กรุณาระบุอาวุธที่ต้องการ : "))
player2 = int(input("ผู้เล่นคนที่ 2 , เลือก ค้อน = 3 , กรรไกร = 2 , กระดาษ = 1 กรุณาระบุอาวุธที่ต้องการ : "))

if player1 < 0:
    print("ผู้เล่นที่ 1 กรุณากรอกเลขที่ถูกต้อง")
elif player1 > 3:
    print("ผู้เล่นที่ 1 กรุณากรอกเลขที่ถูกต้อง")
if player2 < 0:
    print("ผู้เล่นที่ 2 กรุณากรอกเลขที่ถูกต้อง")
elif player2 > 3:
    print("ผู้เล่นที่ 2 กรุณากรอกเลขที่ถูกต้อง")
if player1==3 and player2==2:
    print("ผู้เล่นที่ 1 ออกค้อน / ผู้เล่นที่ 2 ออกกรรไกร , ผู้เล่นที่ 1 :เป็นผู้ชนะ")
elif player1==3 and player2==1:
    print("ผู้เล่นที่ 1 ออกค้อน / ผู้เล่นที่ 2 ออกกระดาษ , ผู้เล่นที่ 2 :เป็นผู้ชนะ")
if player1==2 and player2==1:
    print("ผู้เล่นที่ 1 ออกกรรไกร / ผู้เล่นที่ 2 ออกกระดาษ , ผู้เล่นที่ 1 :เป็นผู้ชนะ")
elif player1==2 and player2==3:
    print("ผู้เล่นที่ 1 ออกกรรไกร / ผู้เล่นที่ 2 ออกค้อน , ผู้เล่นที่ 2 :เป็นผู้ชนะ")
if player1==1 and player2==3:
    print("ผู้เล่นที่ 1 ออกกระดาษ / ผู้เล่นที่ 2 ออกค้อน , ผู้เล่นที่ 1 :เป็นผู้ชนะ")
elif player1==1 and player2==2:
    print("ผู้เล่นที่ 1 ออกกระดาษ / ผู้เล่นที่ 2 ออกกรรไกร , ผู้เล่นที่ 2 :เป็นผู้ชนะ")
elif player1 == player2:
    print("ผู้เล่นที่ 1 และ ผู้เล่นที่ 2 ออกเหมือนกัน ผลคือ เสมอกัน")